# Data Cleaning and Preparation

# Handling Missing Data

In [4]:
import numpy as np
import pandas as pd

In [6]:
float_data = pd.Series([1.2,3.5,np.nan,0])
float_data

0    1.2
1    3.5
2    NaN
3    0.0
dtype: float64

In [7]:
float_data.isna()

0    False
1    False
2     True
3    False
dtype: bool

In [8]:
string_data = pd.Series(['aardvark',np.nan,None,'avocado'])
string_data

0    aardvark
1         NaN
2        None
3     avocado
dtype: object

In [9]:
string_data.isna()

0    False
1     True
2     True
3    False
dtype: bool

In [10]:
float_data = pd.Series([1,2,None],dtype ='float64')
float_data

0    1.0
1    2.0
2    NaN
dtype: float64

In [11]:
float_data.isna()

0    False
1    False
2     True
dtype: bool

## NA handling object methods

|Method	|Description|
|-|-|
|dropna	|Filter axis labels based on whether values for each label have missing data, with varying thresholds for how much missing data to tolerate.|
||根据每个标签的值是否包含缺失数据来过滤轴标签，并使用不同的阈值来容忍缺失数据的数量。|
|fillna	|Fill in missing data with some value or using an interpolation method such as "ffill" or "bfill".|
||使用某些值或使用插值方法（例如"ffill"或"bfill"填充缺失数据。|
|isna	|Return Boolean values indicating which values are missing/NA.|
||返回布尔值，指示哪些值缺失/NA。|
|notna	|Negation of isna, returns True for non-NA values and False for NA values.|
||isna的否定，对于非 NA 值返回True ，对于 NA 值返回False 。|

## Filtering Out Missing Data

In [17]:
# for Series
data = pd.Series([1, np.nan, 3.5, np.nan, 7])
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [13]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [16]:
# same result with
data[data.notna()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [19]:
# for DataFrame
data = pd.DataFrame([[1., 6.5, 3.], [1., np.nan, np.nan],
                     [np.nan, np.nan, np.nan], [np.nan, 6.5, 3.]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [20]:
# dropna by default drops any row containing a missing value:
data.dropna()

     0    1    2
0  1.0  6.5  3.0

In [21]:
# how="all" will drop only rows that are all NA
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [22]:
data[4] = np.nan
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [34]:
data.dropna(axis='columns',how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [36]:
df = pd.DataFrame(np.random.standard_normal((7,3)))
df.iloc[:4,1] = np.nan
df.iloc[:2,2] = np.nan
df

          0         1         2
0 -0.180566       NaN       NaN
1 -0.409323       NaN       NaN
2  0.039462       NaN -0.018520
3  0.871068       NaN  1.513187
4 -0.061802  1.677225 -2.106719
5  1.594734  1.166626  0.016112
6 -0.159056 -0.299680  1.808882

In [37]:
df.dropna()

          0         1         2
4 -0.061802  1.677225 -2.106719
5  1.594734  1.166626  0.016112
6 -0.159056 -0.299680  1.808882

In [38]:
df.dropna(thresh=2)

          0         1         2
2  0.039462       NaN -0.018520
3  0.871068       NaN  1.513187
4 -0.061802  1.677225 -2.106719
5  1.594734  1.166626  0.016112
6 -0.159056 -0.299680  1.808882

## Filling in Missing Data

In [39]:
df.fillna(0)

          0         1         2
0 -0.180566  0.000000  0.000000
1 -0.409323  0.000000  0.000000
2  0.039462  0.000000 -0.018520
3  0.871068  0.000000  1.513187
4 -0.061802  1.677225 -2.106719
5  1.594734  1.166626  0.016112
6 -0.159056 -0.299680  1.808882

In [40]:
df.fillna({1:0.5,2:0})

          0         1         2
0 -0.180566  0.500000  0.000000
1 -0.409323  0.500000  0.000000
2  0.039462  0.500000 -0.018520
3  0.871068  0.500000  1.513187
4 -0.061802  1.677225 -2.106719
5  1.594734  1.166626  0.016112
6 -0.159056 -0.299680  1.808882

In [41]:
df = pd.DataFrame(np.random.standard_normal((6,3)))
df.iloc[2:,1] = np.nan
df.iloc[4:,2] = np.nan
df

          0         1         2
0  1.155804 -0.081315 -1.187065
1 -0.111969 -0.085885  1.360198
2 -0.890839       NaN -0.829521
3  0.207553       NaN  1.401190
4 -3.448040       NaN       NaN
5 -0.962241       NaN       NaN

In [42]:
df.fillna(method='ffill')

/var/folders/zm/d0465cgn1zvdzj96xmp0pxww0000gp/T/ipykernel_75996/1193302488.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method='ffill')

          0         1         2
0  1.155804 -0.081315 -1.187065
1 -0.111969 -0.085885  1.360198
2 -0.890839 -0.085885 -0.829521
3  0.207553 -0.085885  1.401190
4 -3.448040 -0.085885  1.401190
5 -0.962241 -0.085885  1.401190

In [43]:
df.fillna(method='ffill',limit=2)

/var/folders/zm/d0465cgn1zvdzj96xmp0pxww0000gp/T/ipykernel_75996/2005079682.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method='ffill',limit=2)

          0         1         2
0  1.155804 -0.081315 -1.187065
1 -0.111969 -0.085885  1.360198
2 -0.890839 -0.085885 -0.829521
3  0.207553 -0.085885  1.401190
4 -3.448040       NaN  1.401190
5 -0.962241       NaN  1.401190

In [45]:
data = pd.Series([1, np.nan,3.5,np.nan,7])
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [46]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

## fillna function arguments

|Argument	|Description|
|-|-|
|value	|Scalar value or dictionary-like object to use to fill missing values|
||用于填充缺失值的标量值或类似字典的对象|
|method	|Interpolation method: one of "bfill" (backward fill) or "ffill" (forward fill); default is None|
||插值方法： "bfill" （向后填充）或"ffill" （向前填充）之一；默认为None|
|axis	|Axis to fill on ("index" or "columns"); default is axis="index"|
||要填充的轴（ "index"或"columns" ）；默认axis="index"|
|limit	|For forward and backward filling, maximum number of consecutive periods to fill|
||对于向前和向后填充，要填充的最大连续周期数|

# Data Transformation

## Removing Duplicates

In [47]:
data = pd.DataFrame({"k1": ["one", "two"] * 3 + ["two"],
                     "k2": [1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [48]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [49]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [51]:
data['v1']=range(7)
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [52]:
data.drop_duplicates(subset=['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [53]:
data.drop_duplicates(['k1','k2'],keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

## Transforming Data Using a Function or Mapping

In [54]:
data = pd.DataFrame({'food':["bacon", "pulled pork", "bacon",
                             "pastrami", "corned beef", "bacon",
                             "pastrami", "honey ham", "nova lox"],
                      "ounces": [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     pastrami     6.0
4  corned beef     7.5
5        bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [55]:
meat_to_animal = {
  "bacon": "pig",
  "pulled pork": "pig",
  "pastrami": "cow",
  "corned beef": "cow",
  "honey ham": "pig",
  "nova lox": "salmon"
}

In [56]:
data['animal'] = data['food'].map(meat_to_animal)
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     pastrami     6.0     cow
4  corned beef     7.5     cow
5        bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [57]:
def get_animal(x):
    return meat_to_animal[x]

data['food'].map(get_animal)

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

## Replacing Values

In [58]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [59]:
data.replace(-999,np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [60]:
data.replace([-999,-1000],np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [61]:
data.replace([-999,-1000],[np.nan,0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [62]:
data.replace({-999:np.nan, -1000:0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

## Renaming Axis Indexes

In [63]:
data = pd.DataFrame(np.arange(12).reshape((3,4)),
                    index=["Ohio", "Colorado", "New York"],
                    columns=["one", "two", "three", "four"])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [64]:
def transform(x):
    return x[:4].upper()

data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [66]:
data.index = data.index.map(transform)
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [67]:
data.rename(index = str.title, columns = str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [68]:
data.rename(index={"OHIO": "INDIANA"},
            columns={"three": "peekaboo"})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

## Discretization and Binning

In [71]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [72]:
bins = [18, 25, 35, 60, 100]

In [73]:
age_categories = pd.cut(ages,bins)
age_categories

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64, right]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [74]:
age_categories.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [75]:
age_categories.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]], dtype='interval[int64, right]')

In [76]:
age_categories.categories[0]
#closed是指包含

Interval(18, 25, closed='right')

In [77]:
pd.value_counts(age_categories)

/var/folders/zm/d0465cgn1zvdzj96xmp0pxww0000gp/T/ipykernel_75996/3010498523.py:1: FutureWarning: pandas.value_counts is deprecated and will be removed in a future version. Use pd.Series(obj).value_counts() instead.
  pd.value_counts(age_categories)

(18, 25]     5
(25, 35]     3
(35, 60]     3
(60, 100]    1
Name: count, dtype: int64

In [79]:
pd.cut(ages,bins,right=False)

[[18, 25), [18, 25), [25, 35), [25, 35), [18, 25), ..., [25, 35), [60, 100), [35, 60), [35, 60), [25, 35)]
Length: 12
Categories (4, interval[int64, left]): [[18, 25) < [25, 35) < [35, 60) < [60, 100)]

In [81]:
group_names=['Youth','YoungAdult','MiddleAged','Senior']
pd.cut(ages, bins, labels=group_names)

['Youth', 'Youth', 'Youth', 'YoungAdult', 'Youth', ..., 'YoungAdult', 'Senior', 'MiddleAged', 'MiddleAged', 'YoungAdult']
Length: 12
Categories (4, object): ['Youth' < 'YoungAdult' < 'MiddleAged' < 'Senior']

In [82]:
data = np.random.uniform(size=20)
pd.cut(data,4,precision=2)

[(0.29, 0.52], (0.52, 0.76], (0.52, 0.76], (0.29, 0.52], (0.76, 0.99], ..., (0.52, 0.76], (0.52, 0.76], (0.052, 0.29], (0.052, 0.29], (0.52, 0.76]]
Length: 20
Categories (4, interval[float64, right]): [(0.052, 0.29] < (0.29, 0.52] < (0.52, 0.76] < (0.76, 0.99]]

In [83]:
data = np.random.standard_normal(1000)
quartiles=pd.qcut(data,4,precision=2)
quartiles

[(-0.71, -0.048], (-3.21, -0.71], (-0.048, 0.67], (-0.048, 0.67], (-3.21, -0.71], ..., (-0.71, -0.048], (-0.048, 0.67], (0.67, 3.94], (-0.71, -0.048], (-3.21, -0.71]]
Length: 1000
Categories (4, interval[float64, right]): [(-3.21, -0.71] < (-0.71, -0.048] < (-0.048, 0.67] < (0.67, 3.94]]

In [84]:
pd.value_counts(quartiles)

/var/folders/zm/d0465cgn1zvdzj96xmp0pxww0000gp/T/ipykernel_75996/3472704981.py:1: FutureWarning: pandas.value_counts is deprecated and will be removed in a future version. Use pd.Series(obj).value_counts() instead.
  pd.value_counts(quartiles)

(-3.21, -0.71]     250
(-0.71, -0.048]    250
(-0.048, 0.67]     250
(0.67, 3.94]       250
Name: count, dtype: int64

In [85]:
pd.qcut(data,[0,0.1,0.5,0.9,1]).value_counts()

(-3.201, -1.39]     100
(-1.39, -0.0483]    400
(-0.0483, 1.196]    400
(1.196, 3.945]      100
Name: count, dtype: int64

## Detecting and Filtering Outliers

In [86]:
data = pd.DataFrame(np.random.standard_normal((1000,4)))
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.036646     0.015634     0.021130    -0.013543
std       1.010609     1.006049     1.006185     0.977450
min      -3.231258    -3.474667    -3.413976    -2.931713
25%      -0.691123    -0.649302    -0.639660    -0.689755
50%      -0.073203     0.013819     0.015219    -0.019302
75%       0.651078     0.723879     0.696788     0.673813
max       2.599925     3.579569     3.926695     2.736021

In [87]:
col = data[2]
col[col.abs() > 3]

263    3.926695
577   -3.413976
601    3.236472
934    3.388749
Name: 2, dtype: float64

In [88]:
data[(data.abs() > 3).any(axis = 'columns')]

            0         1         2         3
37  -0.934610 -3.084245 -0.482283 -1.623173
95  -0.109214 -3.474667 -0.573350  2.365961
238 -3.231258 -0.557359 -1.070965 -0.789185
263  0.202718  0.205066  3.926695 -1.103474
323 -3.161323  1.142795 -0.519326  0.158720
355 -0.078049  3.129967 -0.984636  0.530860
573 -0.117331  3.446846 -1.151410 -1.552983
577  0.013802 -0.621791 -3.413976 -1.167381
601 -0.009041  1.270402  3.236472 -1.600399
739  1.552471  3.041479 -0.633470  0.300887
741 -0.379776  3.579569 -0.772373  0.173566
934  0.315967  1.886791  3.388749 -0.210298

In [90]:
data[data.abs() >3] = np.sign(data) * 3
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.036253     0.014995     0.019992    -0.013543
std       1.009417     1.000408     0.999704     0.977450
min      -3.000000    -3.000000    -3.000000    -2.931713
25%      -0.691123    -0.649302    -0.639660    -0.689755
50%      -0.073203     0.013819     0.015219    -0.019302
75%       0.651078     0.723879     0.696788     0.673813
max       2.599925     3.000000     3.000000     2.736021

In [91]:
np.sign(data).head()

     0    1    2    3
0  1.0  1.0 -1.0 -1.0
1 -1.0 -1.0  1.0  1.0
2  1.0 -1.0 -1.0 -1.0
3 -1.0  1.0 -1.0  1.0
4  1.0 -1.0  1.0 -1.0

## Permutation and Random Sampling

In [92]:
df = pd.DataFrame(np.arange(5*7).reshape((5,7)))
df

    0   1   2   3   4   5   6
0   0   1   2   3   4   5   6
1   7   8   9  10  11  12  13
2  14  15  16  17  18  19  20
3  21  22  23  24  25  26  27
4  28  29  30  31  32  33  34

In [93]:
sampler = np.random.permutation(5)
sampler

array([3, 2, 1, 4, 0])

In [94]:
df.take(sampler)

    0   1   2   3   4   5   6
3  21  22  23  24  25  26  27
2  14  15  16  17  18  19  20
1   7   8   9  10  11  12  13
4  28  29  30  31  32  33  34
0   0   1   2   3   4   5   6

In [96]:
df.iloc[sampler]

    0   1   2   3   4   5   6
3  21  22  23  24  25  26  27
2  14  15  16  17  18  19  20
1   7   8   9  10  11  12  13
4  28  29  30  31  32  33  34
0   0   1   2   3   4   5   6

In [97]:
column_sampler = np.random.permutation(7)
column_sampler

array([2, 1, 4, 3, 5, 6, 0])

In [98]:
df.take(column_sampler,axis='columns')

    2   1   4   3   5   6   0
0   2   1   4   3   5   6   0
1   9   8  11  10  12  13   7
2  16  15  18  17  19  20  14
3  23  22  25  24  26  27  21
4  30  29  32  31  33  34  28

In [100]:
df.sample(n=3)

    0   1   2   3   4   5   6
1   7   8   9  10  11  12  13
3  21  22  23  24  25  26  27
4  28  29  30  31  32  33  34

In [101]:
choices = pd.Series([5,7,-1,6,4])
choices.sample(n=10,replace=True)

3    6
0    5
2   -1
1    7
2   -1
1    7
2   -1
3    6
4    4
1    7
dtype: int64

## Computing Indicator/Dummy Variables

In [102]:
df = pd.DataFrame({"key": ["b", "b", "a", "c", "a", "b"],
                   "data1": range(6)})
df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [104]:
pd.get_dummies(df['key'],dtype=float)

     a    b    c
0  0.0  1.0  0.0
1  0.0  1.0  0.0
2  1.0  0.0  0.0
3  0.0  0.0  1.0
4  1.0  0.0  0.0
5  0.0  1.0  0.0

In [105]:
dummies = pd.get_dummies(df["key"], prefix="key", dtype=float)
df_with_dummy = df[["data1"]].join(dummies)
df_with_dummy

   data1  key_a  key_b  key_c
0      0    0.0    1.0    0.0
1      1    0.0    1.0    0.0
2      2    1.0    0.0    0.0
3      3    0.0    0.0    1.0
4      4    1.0    0.0    0.0
5      5    0.0    1.0    0.0

In [107]:
mnames = ["movie_id", "title", "genres"]
movies = pd.read_table('/Users/qian/Desktop/DATA/WESMdatasets/movielens/movies.dat',sep='::',
                       header=None, names=mnames, engine="python")
movies[:10]

   movie_id                               title                        genres
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy
5         6                         Heat (1995)         Action|Crime|Thriller
6         7                      Sabrina (1995)                Comedy|Romance
7         8                 Tom and Huck (1995)          Adventure|Children's
8         9                 Sudden Death (1995)                        Action
9        10                    GoldenEye (1995)     Action|Adventure|Thriller

In [112]:
dummies = movies['genres'].str.get_dummies('|')
dummies.iloc[:10,:6]

   Action  Adventure  Animation  Children's  Comedy  Crime
0       0          0          1           1       1      0
1       0          1          0           1       0      0
2       0          0          0           0       1      0
3       0          0          0           0       1      0
4       0          0          0           0       1      0
5       1          0          0           0       0      1
6       0          0          0           0       1      0
7       0          1          0           1       0      0
8       1          0          0           0       0      0
9       1          1          0           0       0      0

In [115]:
movies_windic = movies.join(dummies.add_prefix('genre_'))
movies_windic.iloc[0]

movie_id                                       1
title                           Toy Story (1995)
genres               Animation|Children's|Comedy
genre_Action                                   0
genre_Adventure                                0
genre_Animation                                1
genre_Children's                               1
genre_Comedy                                   1
genre_Crime                                    0
genre_Documentary                              0
genre_Drama                                    0
genre_Fantasy                                  0
genre_Film-Noir                                0
genre_Horror                                   0
genre_Musical                                  0
genre_Mystery                                  0
genre_Romance                                  0
genre_Sci-Fi                                   0
genre_Thriller                                 0
genre_War                                      0
genre_Western                                  0
Name: 0, dtype: object

In [116]:
np.random.seed(12345) # to make the example repeatable
values = np.random.uniform(size=10)
values

array([0.92961609, 0.31637555, 0.18391881, 0.20456028, 0.56772503,
       0.5955447 , 0.96451452, 0.6531771 , 0.74890664, 0.65356987])

In [117]:
bins=[0,0.2,0.4,0.6,0.8,1]
pd.get_dummies(pd.cut(values,bins))

   (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0       False       False       False       False        True
1       False        True       False       False       False
2        True       False       False       False       False
3       False        True       False       False       False
4       False       False        True       False       False
5       False       False        True       False       False
6       False       False       False       False        True
7       False       False       False        True       False
8       False       False       False        True       False
9       False       False       False        True       False

# Extension Data Types